<?php


return [
    //状态判断
    'statu' => [
	    0 => '待审核',
        1 => '正常',
		2 => '冻结'
    ], 
    //是否判断
    'Whether' => [
	    0 => '否',
        1 => '是'
    ],   
    //医院等级
    'classg' => [
	    0 => '三级甲等',
        1 => '三级医院',
        2 => '二级医院',
        3 => '一级医院',
		4 => '对外专科',
		5 => '其他'
    ],
    //医院类别
    'classt' => [
	    0 => '综合医院',
        1 => '眼科医院',
        2 => '儿童医院',
        3 => '妇产科医院',
		4 => '肿瘤医院',
		5 => '传染病医院',
		6 => '骨科医院',
		7 => '口腔医院',
		8 => '肛肠医院',
		9 => '精神病医院',
		10 => '整形医院',
		11 => '脑科医院',
		12 => '职业病医院',
		13 => '心血管医院',
		14 => '胸科医院',
		15 => '肺科医院',
		16 => '中医医院',
		17 => '不孕不育医院'
    ],
    //红利类型
    'dividend_type' => [
        1 => '充值红利',
        2 => '平台红利',
        3 => '返水'
    ],
    //充值类型
    'recharge_type' => [
        1 => '支付宝',
        2 => '微信',
        3 => '银行转账',
        4 => '第三方支付'
    ],
    //充值状态
    'recharge_status' => [
        1 => '待确认',
        2 => '汇款成功',
        3 => '汇款失败'
    ],
    //提款状态
    'drawing_status' => [
        1 => '待确认',
        2 => '提款成功',
        3 => '提款失败'
    ],
    //用户状态
    'member_status' => [
        0 => '启用',
        1 => '禁用'
    ],
    //平台转账类型
    'transfer_type' => [
        0 => '转入游戏',
        1 => '转出游戏'
    ],
    'api_type' => [
        1 => 'AG',
        2 => 'MG',
        3 => 'BBIN'
    ],
    'productType' => [
        1 => 'AG',
        2 => 'MG',
        3 => 'BBIN'
    ],
    'on_line' => [
        0 => '上线',
        1 => '下线'
    ],
    'game_type' => [
        1 => '真人',
        2 => '捕鱼',
        3 => '电子',
        4 => '彩票',
        5 => '体育',
        6 => '棋牌',
        7 => '其他'
    ],
    'activity_type' => [
        1 => '返水活动',
        2 => '红利活动',
        3 => '充值活动',
        4 => '展示活动'
    ],
    'gender' => [
        0 => '男',
        1 => '女'
    ],
    'feedback_type' => [
        1 => '平台问题',
        2 => '财务问题',
        3 => '提供建议'
    ],
    'is_read' => [
        0 => '未读',
        1 => '已读'
    ],
    'productCode' => [
        3=> 'PT',
        12 => 'PNG'
    ],
    'tcg_game_type' => [
        'RNG' => 'RNG',
        'LIVE' => 'LIVE',
        'PVP' => 'PVP'
    ],
    'tcg_client_type' => [
        'pc' => 'pc',
        'phone' => 'phone',
        'web' => 'web',
        'html5' => 'html5'
    ],
    'member_on_line' => [
        1 => '在线',
        2 => '下线'
    ],
    'client_type' => [
        1 => 'pc',
        2 => 'phone'
    ]
];